[
  {
    "id": 1,
    "title":"«24/7/365» для оказания ИТ услуг",
    "src":"case_calendar.jpg",
    "text":"Незаконные схемы передачи голосовых сообщений электросвязи, в том числе и для исходящего международного трафика, все более досягаемы обывателям из-за открытого доступа в Интернете, на тематических сайтах, в социальных сетях и магазинах специального оборудования. Международный голосовой трафик, направленный в обход коммутационных узлов операторов электросвязи, или использование услуги IP-телефонии в неустановленном законодательством порядке влечет финансовые потери для операторов мобильной связи. Общепринятой мерой противодействия подобному мошенничеству выступает развертывание и использование аналитических систем выявления нарушений. Такие системы интегрируются с системами взаиморасчетов, управления сетью и другими системами оператора электросвязи и позволяют обнаружить неправомерные действия и блокировать их инициатора. По договору с международной компанией НР Enterprises CIS, специализирующейся в сфере автоматизации бизнес-процессов, в том числе для операторов мобильной связи, «СиБел» разрабатывала и внедряла программные решения для мониторинга трафика оператора мобильной связи, интегрировала системы контроля утечки доходов (HP Revenue Leakage Control) для крупнейших операторов мобильной связи СНГ. ",
    "status":"Проект"
  },{
  "id": 2,
  "title":"Защита от мошенничества для операторов",
  "src":"case_manMoney.jpg",
  "text":"Незаконные схемы передачи голосовых сообщений электросвязи, в том числе и для исходящего международного трафика, все более досягаемы обывателям из-за открытого доступа в Интернете, на тематических сайтах, в социальных сетях и магазинах специального оборудования.Международный голосовой трафик, направленный в обход коммутационных узлов операторов электросвязи, или использование услуги IP-телефонии в неустановленном законодательством порядке влечет финансовые потери для операторов мобильной связи, а также наказание для тех, кто пытается уменьшить свои расходы или заработать таким образом. Общепринятой мерой противодействия подобному мошенничеству выступает развертывание и использование аналитических систем выявления нарушений. Такие системы интегрируются с системами взаиморасчетов, управления сетью и другими системами оператора электросвязи и позволяют обнаружить неправомерные действия и блокировать их инициатора. По договору с международной компанией НР Enterprises CIS, специализирующейся в сфере автоматизации бизнес-процессов, в том числе для операторов мобильной связи, «СиБел» разрабатывала и внедряла программные решения для мониторинга трафика оператора мобильной связи, интегрировала системы контроля утечки доходов (HP Revenue Leakage Control) и противодействия мошенничеству (HP Fraud Management System) для крупнейших операторов мобильной связи СНГ.",
  "status":"Проект"
},{
  "id": 3,
  "title":"Обучение пользователей работе с ЕИС нотариат",
  "src":"case_PC.jpg",
  "text":"Организация обучения специалистов заказчика навыкам использования автоматизированной информационной системы решает множество задач. Опыт «СиБел» при внедрении автоматизированной информационной системы для нотариата Беларуси показывает, что усилия специалистов по «тонкой настройке» системы и адаптации ее функциональности под потребности пользователей не гарантируют успешной эксплуатации. Для сокращения периода освоения системы ее пользователями и служит этап обучения навыкам работы с функциями системы. Специалисты «СиБел» на базе обучающего центра ИТ-академии «БелХард» провели обучающие курсы по подготовке нотариусов работе с ЕИС нотариата. Работа велась в группах 8–11 человек, что позволяло выстроить командную работу в сочетании с индивидуальным подходом к каждому слушателю. Сочетание обзорных занятий по работе с системой и разбором конкретных кейсов из практики нотариусов снизило дискомфорт, вызванный необходимостью внесения изменений в привычные способы выполнения регулярных действий: ввод документов в систему, обработка документов, проведение различного рода анализа данных средствами системы, генерация отчетности и т. д. Оценку успешности освоения пользователями материалов обучения и потенциальной готовности к самостоятельному использованию ЕИС в границах своих функций и полномочий подтверждали такие методы, как тестирование, анкетирование и сертификация.",
  "status":"Проект"
},{
  "id": 4,
  "title":"Комплексное обслуживание ЦОД",
  "src":"case_switch.jpg",
  "text":"Современные центры обработки данных (ЦОД) предъявляют особенно высокие требования к обслуживанию инженерной инфраструктуры, обеспечивающей работу вычислительного оборудования и систем хранения данных. Остановка работы ЦОД даже на несколько минут может повлечь за собой существенные убытки и нанести ущерб функционированию бизнес-процессов компании. Об этом говорят данные статистики и многочисленные примеры из общемировой практики. Отдел системной интеграции компании «СиБел» оказывает услуги по комплексному сопровождению дата-центров. ИООО «КАПШ Телематик Сервисиз» — наш долгосрочный клиент в оказании услуг для ИТ-инфраструктуры, сотрудничество с которым началось с на этапе проектирования и строительства ЦОД, что позволяет учитывать все особенности объекта. Средства мониторинга компании «СиБел» позволяют удаленно контролировать основные параметры работы ЦОД в режиме реального времени.",
  "status":"Проект"
},{
  "id": 5,
  "title":"«Штурман»: телематический сервис",
  "src":"case_shturman.jpg",
  "text":"Нарушение зрения делает человека зависимым от помощи окружающих людей. Развитие решений в сфере мобильных устройств сделало возможным оказание помощи «на расстоянии». \r\n Компания «СиБел» разрабатывает программно-аппаратный комплекс, позволяющий передавать видео в режиме реального времени и обеспечивать связь людей с нарушениями зрения через диспетчера с людьми, готовыми оказывать необходимую помощь. Мы уверены, что «Штурман» поможет людям с особенными потребностями расширить круг самостоятельных действий без помощи сопровождающих лиц и увеличить коммуникационные возможности незрячих и слабовидящих. Команда «СиБел» готова содействовать развитию безбарьерной среды и интеграции в общество людей с ограниченными возможностями. Использование открытого программного обеспечения позволяет избежать покупки дорогостоящих лицензий и делает сервис доступным для широкого применения. Аналогов, описанному решению, на территории СНГ не имеется.",
  "status":"Идея"
},{
  "id": 6,
  "title":"Взаимодействие: ЕИС и внешние системы",
  "src":"case_train.jpg",
  "text":"Для эффективной работы \r\n Единая информационная система нотариата Беларуси должна обеспечивать взаимодействие с иными информационными системами:  \r\n Государственный информационный ресурс (ГИР) «Регистр населения»   \n ГИР «Информационные объекты автоматизированной системы «Паспорт»   \n ГИР «Единый государственный регистр юридических лиц и индивидуальных предпринимателей»  ГИР «Государственный регистр недвижимого имущества, прав на него и сделок с ним»   \n ГИР «Государственный информационный ресурс о ценных бумагах,  \n права на которые ограничены залоговыми обязательствами» \n  ГИР «База данных автоматизированной информационной системы «ГАИ-Центр»  ГИР «Государственный реестр плательщиков (иных обязанных лиц)»  система ДФМ (создание, направление спецформуляров и получение квитанций, учет и хранение спецформуляров и квитанций)  система МНС  АИС-ВИП  БД недееспособных лиц, БД обязанных лиц Верховного суда  БД исполкомов, органов опеки и попечительства (отдел образования) внешний портал БНП.",
  "status":"Проект"
}
]
