[
  {
    "id": 1,
    "title": "«24/7/365» для аказання ІТ-паслуг ",
    "src": "case_calendar.jpg",
    "text": "Многія сэрвісы і паслугі надзейна ўвайшлі ў свядомасць спажыўцоў як «заўсёды даступныя». Кругласутачныя крамы і дзяжурныя аптэкі, службы таксі і «хуткая дапамога», чыгуначны і паветраны транспарт працуюць 24 гадзіны ў суткі сем дзён у тыдзень без святаў і выхадных. Такі рэжым аказання сэрвісу запатрабаваны карыстальнікамі, а для пастаўшчыкоў паслуг дыктуецца крытэрыямі эфектыўнасці, бяспекі і надзейнасці бізнес-працэсаў. Формула «24/7/365» для аказання ІТ-паслуг рэалізуецца кампаніяй «СіБел» з 2013 года. Доўгатэрміновы дагавор з кампаніяй ЗТАА «Капш Тэлематык Сэрвисиз», якая з'яўляецца аператарам сістэмы «Белтол», замацаваў умовы сэрвіснага абслугоўвання і падтрымкі інфармацыйнай сістэмы (тэлекамунікацый, сервернага абсталявання, аперацыйных сістэм і г. д.) у рэжыме «24/7/365» . ",
    "status": " Праект "
  },
  {
    "id": 2,
    "title": "Абарона ад махлярства для аператараў электрасувязі ",
    "src": "case_manMoney.jpg",
    "text": "Незаконныя схемы перадачы галасавых паведамленняў электрасувязі, у тым ліку і для выходнага міжнароднага трафіку, усё больш даступныя абывацелям з-за адкрытай дасяжнасці ў Інтэрнэце, на тэматычных сайтах, у сацыяльных сетках і крамах спецыяльнага абсталявання. Міжнародны галасавы трафік, накіраваны ў абыход камутацыйных вузлоў аператараў электрасувязі, або выкарыстанне паслугі IP-тэлефаніі ў неўсталяваным заканадаўствам парадку цягне фінансавыя страты для аператараў мабільнай сувязі, а таксама пакаранне для тых, хто спрабуе паменшыць свае выдаткі або зарабіць такім чынам. Агульнапрынятай мерай процідзеяння падобнаму махлярству выступае разгортванне і выкарыстанне аналітычных сістэм выяўлення парушэнняў. Такія сістэмы інтэгруюцца з сістэмамі ўзаемаразлікаў, кіравання сеткай і іншымі сістэмамі аператара электрасувязі і дазваляюць выявіць неправамерныя дзеянні і блакаваць іх ініцыятара. Па дамове з міжнароднай кампаніяй НР Enterprises CIS, якая спецыялізуецца ў сферы аўтаматызацыі бізнес-працэсаў, у тым ліку для аператараў мабільнай сувязі, «СіБел» распрацоўвала і ўкараняла праграмныя рашэнні для маніторынгу трафіку аператара мабільнай сувязі, інтэгравала сістэмы кантролю ўцечкі даходаў (HP Revenue Leakage Control) і процідзеяння махлярству (HP Fraud Management System) для найбуйнейшых аператараў мабільнай сувязі СНД.",
    "status": "Праект "
  },
  {
    "id": 3,
    "title": "Навучанне карыстальнікаў рабоце з АІС натарыята ",
    "src": "case_PC.jpg",
    "text": "Арганізацыя навучання спецыялістаў заказчыка навыкам выкарыстання аўтаматызаванай інфармацыйнай сістэмы вырашае мноства задач. Досвед «СіБел» пры ўкараненні аўтаматызаванай інфармацыйнай сістэмы для натарыята Беларусі паказвае, што намаганні спецыялістаў па «тонкай наладзе» сістэмы і адаптацыі яе функцыянальнасці пад патрэбы карыстальнікаў не гарантуюць паспяховай эксплуатацыі. Для скарачэння перыяду асваення сістэмы яе карыстальнікамі і служыць этап навучання навыкам працы з функцыямі сістэмы. Спецыялісты «СіБел» на базе навучальнага цэнтра ІТ-акадэміі «БелХард» правялі навучальныя курсы па падрыхтоўцы натарыусаў працы з АІС натарыята. Праца вялася ў групах 8–11 чалавек, што дазволіла пабудаваць камандную работу ў спалучэнні з індывідуальным падыходам да кожнага слухача. Спалучэнне аглядных заняткаў па працы з сістэмай і разборам канкрэтных кейсаў з практыкі натарыусаў знізіла дыскамфорт, выкліканы неабходнасцю ўнясення змяненняў у звыклыя спосабы выканання рэгулярных дзеянняў: увод дакументаў у сістэму, апрацоўка дакументаў, правядзенне рознага роду аналізу дадзеных сродкамі сістэмы, генерацыя справаздачнасці і г. д. Ацэнку паспяховасці асваення карыстальнікамі матэрыялаў навучання і патэнцыйнай гатоўнасці да самастойнага выкарыстання АІС ў межах сваіх функцый і паўнамоцтваў пацвярджалі такія метады, як тэставанне, анкетаванне і сертыфікацыя.",
    "status": "Праект "
  },
  {
    "id": 4,
    "title": "Комплекснае абслугоўванне ЦАД ",
    "src": "case_switch.jpg",
    "text": "Сучасныя цэнтры апрацоўкі дадзеных (ЦАД) прад'яўляюць асабліва высокія патрабаванні да абслугоўвання інжынернай інфраструктуры, якая забяспечвае работу вылічальнага абсталявання і сістэм захоўвання дадзеных. Прыпынак працы ЦАД нават на некалькі хвілін можа пацягнуць за сабой істотныя страты і нанесці шкоду функцыянаванню бізнес-працэсаў кампаніі. Пра гэта сведчаць дадзеныя статыстыкі і шматлікія прыклады з агульнасусветнай практыкі. Аддзел сістэмнай інтэграцыі кампаніі «СіБел» аказвае паслугі па комплексным суправаджэнні дата-цэнтраў. ЗТАА «Капш Тэлематык Сервісіз» — наш доўгатэрміновы кліент ў аказанні паслуг для ІТ-інфраструктуры, супрацоўніцтва з якім пачалося на этапе праектавання і будаўніцтва ЦАД, што дазваляе ўлічваць усе асаблівасці аб'екта. Сродкі маніторынгу кампаніі «СіБел» дазваляюць выдалена кантраляваць асноўныя параметры працы ЦАД ў рэжыме рэальнага часу.",
    "status": "Праект "
  },
  {
    "id": 5,
    "title": "«Штурман»: тэлематычны сэрвіс ",
    "src": "case_shturman.jpg",
    "text": "Пашкоджаны зрок робіць чалавека залежным ад дапамогі іншых людзей. Развіццё рашэнняў у сферы мабільных прылад зрабіла магчымым аказанне дапамогі «на адлегласці». Кампанія «СіБел» распрацоўвае праграмна-апаратны комплекс, які дазваляе перадаваць відэа ў рэжыме рэальнага часу і забяспечваць сувязь чалавека з парушэннямі зроку праз дыспетчара з людзьмі, гатовымі аказваць неабходную дапамогу. Мы ўпэўненыя, што «Штурман» дапаможа людзям з асаблівымі патрэбамі пашырыць кола самастойных дзеянняў без дапамогі асоб суправаджэння і павялічыць камунікацыйныя магчымасці невідушчых і слабавідушчых. Каманда «СіБел» гатова садзейнічаць развіццю безбар'ернага асяроддзя і інтэграцыі ў грамадства людзей з абмежаванымі магчымасцямі. Выкарыстанне адкрытага праграмнага забеспячэння дазваляе пазбегнуць пакупкі дарагіх ліцэнзій і робіць сэрвіс даступным для шырокага прымянення. Аналагаў, апісанаму рашэнню, на тэрыторыі СНД не маецца.",
    "status": "Ідэя "
  },
  {
    "id": 6,
    "title": "Узаемадзеянне: АІС і знешнія сістэмы ",
    "src": "case_train.jpg",
    "text": "Для эфектыўнай працы Адзіная інфармацыйная сістэма натарыята Беларусі павінна забяспечваць узаемадзеянне з іншымі інфармацыйнымі сістэмамі: • Дзяржаўны інфармацыйны рэсурс (ДзІР) «Рэгістр насельніцтва»; ДзІР «Інфармацыйныя аб'екты аўтаматызаванай сістэмы« Пашпарт »; • ДзІР «Адзіны дзяржаўны рэгістр юрыдычных асоб і індывідуальных прадпрымальнікаў»; • ДзІР «Дзяржаўны рэгістр нерухомай маёмасці, правоў на яе і здзелак з ёй»; • ДзІР «Дзяржаўны інфармацыйны рэсурс аб каштоўных паперах, правы на якія абмежаваныя залогавымі абавязальніцтвамі»; • ДзІР «База дадзеных аўтаматызаванай інфармацыйнай сістэмы «ДАІ-Цэнтр »; • ДзІР «Дзяржаўны рэестр плацельшчыкаў (iншых абавязаных асоб)»; • сістэма ДФМ (стварэнне, кірунак спецфармуляры і атрыманне квітанцый, улік і захоўванне спецфармуляры і квітанцый); • сістэма МПЗ; • АІС-ВІП; • БД недзеяздольных асоб, БД абавязаных асоб Вярхоўнага суда; • БД выканкамаў, органаў апекі і папячыцельства (аддзел адукацыі); • знешні партал БНП.",
    "status": "Праект"
  }
]
